package com.Familyship.checkkuleogi.domains.book.domain.enums;

//MBTI별 키워드
public class MBTIKeywords {

    //EI
    public static final String E_KEYWORDS = "모험, 우정, 협력, 리더십, 팀워크, 사교, 경쟁, 활발함, 다이나믹, 대화, "
            +"인간관계, 영향력, 성장, 성취, 인기, 연대감, 열정, 에너지, 유머, 발견, "
            +"사회적 성공, 설득력, 동기부여, 참여, 액션, 활력, 외부 세계, 사건 중심, 위험감수, 자극, "
            +"여행, 도전, 리더십의 갈등, 역동적 변화, 팀 플레이, 대중성, 현장 경험, 즉각적 보상, 네트워킹, 커뮤니케이션";
    public static final String I_KEYWORDS = "내면 탐구, 자기 성찰, 고요함, 심리적 깊이, 철학, 성숙, 집중력, 창의성, 감정 분석, 미세한 변화, "
            +"깊이 있는 관계, 감성적 연결, 관찰, 내면의 평화, 독립적 사고, 사색, 조용한 힘, 개인적 성장, 상상력, 신중함, "
            +"자기 발견, 명상, 내적 충실함, 섬세한 감정, 감정의 여운, 상징성, 자아 인식, 직관, 내적 경험, 삶의 의미, "
            +"조용한 갈등, 은우, 예술적 표현, 시적 상상력, 소수의 관계, 독립, 정신적 여정, 성찰적 대화, 감정적 이해, 인내";

    //SN
    public static final String S_KEYWORDS = "현실적인, 세부 묘사, 구체적인 정보, 논리적인 전개, 사실 기반, 직관적이지 않음, 정확성, 일상생활, 실제 경험, 현재 중심, "
            +"실용적인 지식, 체계적인 과정, 문제 해결, 점진적인 변화, 관찰력, 효율성, 계획된 진행, 책임감, 반복 가능한 과정, 분석적 사고, "
            +"데이터 기반, 구체적 성과, 실생활 적용, 세부사항에 대한 주의, 절차적, 명확한 설명, 실증적 증거, 기능적 접근, 점진적 성장, 실용적 판단, "
            +"보편적인 경험, 검증된 방법, 실전 지식, 실험적, 명확한 목표, 정확한 계산, 통계적 분석, 객관적인 판단, 구체적 목표, 사실적 묘사";
    public static final String N_KEYWORDS = "영감, 상상력, 미래 전망, 가능성 탐색, 창의적 사고, 추상적 개념, 직관적 이해, 혁신적인 접근, 의미 탐구, 큰 그림, " +
            "상징적 표현, 예측력, 신속한 결정, 혁신적 변화, 비약적 사고, 꿈과 희망, 잠재력 발굴, 모험적 시도, 비전 제시, 연관성 찾기, " +
            "상상적 이야기, 영적인 탐구, 미래 가능성, 신비로운 주제, 새로운 발상, 대담한 도전, 통찰력, 창조적인 해결책, 유연한 사고, 대안적 시각, " +
            "새로운 경로, 발견과 혁신, 모호한 상황 속 확신, 다층적 의미, 철학적 탐구, 새로운 가능성 열기, 미래 지향적 목표, 실험적 사고, 창의적 상상, 급진적 변화";

    //TF
    public static final String T_KEYWORDS = "논리, 분석, 객관성, 사실, 진실, 체계, 비판적 사고, 구조, 효율성, 이성, " +
            "문제 해결, 규칙, 논증, 명확성, 공정성, 원칙, 증거, 계획, 결정, 전략, " +
            "논리적 추론, 법칙, 객관적 관점, 명료함, 정보, 평가, 분석력, 논리적 구조, 정확성, 객관적 진리, " +
            "질서, 추리, 결과, 해결책, 추론, 검증, 논리적 사고, 명백성, 객관적 자료, 생산성";
    public static final String F_KEYWORDS = "감정, 관계, 공감, 이해, 따뜻함, 배려, 감성, 상호작용, 연결, 동정심, " +
            "협력, 사랑, 감정적 연대, 소통, 인간미, 친절, 협력, 인정, 감정의 흐름, 공감대, " +
            "배려심, 감동, 신뢰, 용서, 정서적 안정, 따뜻한 관계, 심리적 유대, 정서적 표현, 존중, 감정적 유대감, " +
            "친밀감, 충성심, 희생, 화합, 위로, 정서적 연결, 봉사, 용기, 진심, 관계의 질 ";

    //JP
    public static final String J_KEYWORDS = "계획, 목표, 조직, 규칙, 기한, 체계, 시간엄수, 안정성, 일정, 결단력, " +
            "목표달성, 질서, 효율성, 규율, 절차, 예측가능성, 마감, 구조, 철저함, 통제, " +
            "일정관리, 목표지향, 논리적 흐름, 실행력, 완벽성, 세부사항, 준비성, 관리, 규제, 결정, " +
            "명확성, 일관성, 정리정돈, 결과 지향, 계획성, 고정된 방향, 통제력, 조직화, 분명한 목적, 정돈된 프로세스";
    public static final String P_KEYWORDS = "자율성, 융통성, 탐험, 자유, 변화, 즉흥성, 다양성, 유연성, 발견, 모험, " +
            "개방성, 적응력, 창의성, 선택의 자유, 상황 적응, 변화 수용, 미지의 세계, 유동성, 즉각적 결정, 호기심, " +
            "탐구, 개방된 가능성, 유연한 일정, 유동적인 목표, 다이나믹, 변덕, 상황 변화, 새로운 시도, 예측 불가, 자유로운 흐름, " +
            "모험심, 즉흥적인 결정, 즉시 반응, 임기응변, 즉각적 만족, 미정의 결과, 개방적 사고, 예상치 못한 사건, 창의적 변화, 새로운 접근";
}
